RT-Thread/rt-thread/bsp/lpc55sxx/Libraries/LPC55S28/LPC55S28/drivers/fsl_sdif.c
/* SDIF ISR for transactional APIs. */
#if defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
static sdif_isr_t s_sdifIsr = (sdif_isr_t)DefaultISR;
#else
static sdif_isr_t s_sdifIsr;
#endif

/*******************************************************************************
 * Code
 ******************************************************************************/
static uint32_t SDIF_GetInstance(SDIF_Type *base)
{
    uint8_t instance = 0U;

    while ((instance < ARRAY_SIZE(s_sdifBase)) && (s_sdifBase[instance] != base))
    {
        instance++;
    }

    assert(instance < ARRAY_SIZE(s_sdifBase));

    return instance;
}

static status_t SDIF_TransferConfig(SDIF_Type *base, sdif_transfer_t *transfer, bool enDMA)
{
    sdif_command_t *command = transfer->command;
    sdif_data_t *data       = transfer->data;

    if ((command == NULL) || ((data != NULL) && (data->blockSize > SDIF_BLKSIZ_BLOCK_SIZE_MASK)))
    {
        return kStatus_SDIF_InvalidArgument;
    }

    if (data != NULL)
    {
        /* config the block size register ,the block size maybe smaller than FIFO
         depth, will test on the board */
        base->BLKSIZ = SDIF_BLKSIZ_BLOCK_SIZE(data->blockSize);
        /* config the byte count register */
        base->BYTCNT = SDIF_BYTCNT_BYTE_COUNT(data->blockSize * data->blockCount);

        command->flags |= (uint32_t)kSDIF_DataExpect; /* need transfer data flag */

        if (data->txData != NULL)
        {
            command->flags |= (uint32_t)kSDIF_DataWriteToCard; /* data transfer direction */
        }
        else
        {
            /* config the card read threshold,enable the card read threshold */
            if (data->blockSize <= (SDIF_FIFO_COUNT * sizeof(uint32_t)))
            {
                base->CARDTHRCTL = SDIF_CARDTHRCTL_CARDRDTHREN_MASK | SDIF_CARDTHRCTL_CARDTHRESHOLD(data->blockSize);
            }
            else
            {
                base->CARDTHRCTL &= ~SDIF_CARDTHRCTL_CARDRDTHREN_MASK;
            }
        }

        if (data->streamTransfer)
        {
            command->flags |=
                (uint32_t)kSDIF_DataStreamTransfer; /* indicate if use stream transfer or block transfer  */
        }

        if ((data->enableAutoCommand12) &&
            (data->blockCount > 1UL)) /* indicate if auto stop will send after the data transfer done */
        {
            command->flags |= (uint32_t)kSDIF_DataTransferAutoStop;
        }
    }
    /* R2 response length long */
    if (command->responseType == (uint32_t)kCARD_ResponseTypeR2)
    {
        command->flags |= ((uint32_t)kSDIF_CmdCheckResponseCRC | (uint32_t)kSDIF_CmdResponseLengthLong |
                           (uint32_t)kSDIF_CmdResponseExpect);
    }
    else if ((command->responseType == (uint32_t)kCARD_ResponseTypeR3) ||
             (command->responseType == (uint32_t)kCARD_ResponseTypeR4))
    {
        command->flags |= (uint32_t)kSDIF_CmdResponseExpect; /* response R3 do not check Response CRC */
    }
    else
    {
        if (command->responseType != (uint32_t)kCARD_ResponseTypeNone)
        {
            command->flags |= ((uint32_t)kSDIF_CmdCheckResponseCRC | (uint32_t)kSDIF_CmdResponseExpect);
        }
    }

    if (command->type == (uint32_t)kCARD_CommandTypeAbort)
    {
        command->flags |= (uint32_t)kSDIF_TransferStopAbort;
    }

    /* wait pre-transfer complete */
    command->flags |= (uint32_t)kSDIF_WaitPreTransferComplete | (uint32_t)kSDIF_CmdDataUseHoldReg;

    /* handle interrupt and status mask */
    if (data != NULL)
    {
        SDIF_ClearInterruptStatus(base, (uint32_t)kSDIF_AllInterruptStatus);
        if (enDMA)
        {
            SDIF_ClearInternalDMAStatus(base, kSDIF_DMAAllStatus);
            SDIF_EnableDmaInterrupt(base, kSDIF_DMAAllStatus);
            SDIF_EnableInterrupt(base, (uint32_t)kSDIF_CommandTransferStatus);
        }
        else
        {
            SDIF_EnableInterrupt(base, (uint32_t)kSDIF_CommandTransferStatus | (uint32_t)kSDIF_DataTransferStatus);
        }
    }
    else
    {
        SDIF_ClearInterruptStatus(base, kSDIF_CommandTransferStatus);
        SDIF_EnableInterrupt(base, kSDIF_CommandTransferStatus);
    }

    return kStatus_Success;
}

static status_t SDIF_ReadCommandResponse(SDIF_Type *base, sdif_command_t *command)
{
    /* check if command exist,if not, do not read the response */
    if (NULL != command)
    {
        /* read response */
        command->response[0U] = base->RESP[0U];
        if (command->responseType == (uint32_t)kCARD_ResponseTypeR2)
        {
            command->response[1U] = base->RESP[1U];
            command->response[2U] = base->RESP[2U];
            command->response[3U] = base->RESP[3U];
        }

        if ((command->responseErrorFlags != 0U) && ((command->responseType == (uint32_t)kCARD_ResponseTypeR1) ||
                                                    (command->responseType == (uint32_t)kCARD_ResponseTypeR1b) ||
                                                    (command->responseType == (uint32_t)kCARD_ResponseTypeR6) ||
                                                    (command->responseType == (uint32_t)kCARD_ResponseTypeR5)))
        {
            if (((command->responseErrorFlags) & (command->response[0U])) != 0UL)
            {
                return kStatus_SDIF_ResponseError;
            }
        }
    }

    return kStatus_Success;
}

static status_t SDIF_WaitCommandDone(SDIF_Type *base, sdif_command_t *command)
{
    uint32_t status      = 0U;
    uint32_t errorStatus = (uint32_t)kSDIF_ResponseError | (uint32_t)kSDIF_ResponseTimeout |
                           (uint32_t)kSDIF_DataStartBitError | (uint32_t)kSDIF_HardwareLockError |
                           (uint32_t)kSDIF_ResponseCRCError;

    do
    {
        status = SDIF_GetInterruptStatus(base);
    } while ((status & (errorStatus | (uint32_t)kSDIF_CommandDone)) == 0UL);
    /* clear interrupt status flag first */
    SDIF_ClearInterruptStatus(base, status & (uint32_t)kSDIF_CommandTransferStatus);
    if ((status & errorStatus) != 0UL)
    {
        return kStatus_SDIF_SendCmdFail;
    }
    else
    {
        return SDIF_ReadCommandResponse(base, command);
    }
}

static status_t SDIF_SetCommandRegister(SDIF_Type *base, uint32_t cmdIndex, uint32_t argument, uint32_t timeout)
{
    uint32_t syncTimeout = timeout;

    base->CMDARG = argument;
    base->CMD    = cmdIndex | SDIF_CMD_START_CMD_MASK;

    while ((base->CMD & SDIF_CMD_START_CMD_MASK) == SDIF_CMD_START_CMD_MASK)
    {
        if (timeout == 0U)
        {
            break;
        }

        if (0UL == syncTimeout)
        {
            return kStatus_SDIF_SyncCmdTimeout;
        }

