RT-Thread/rt-thread/bsp/lpc55sxx/Libraries/LPC55S28/LPC55S28/drivers/fsl_sdif.c
static void SDIF_TransferHandleIRQ(SDIF_Type *base, sdif_handle_t *handle)
{
    assert(handle != NULL);

    uint32_t interruptFlags, dmaInterruptFlags;

    interruptFlags    = SDIF_GetEnabledInterruptStatus(base);
    dmaInterruptFlags = SDIF_GetEnabledDMAInterruptStatus(base);

    if (IS_SDIF_FLAG_SET(interruptFlags, kSDIF_CommandTransferStatus))
    {
        SDIF_TransferHandleCommand(base, handle, interruptFlags);
    }
    if (IS_SDIF_FLAG_SET(interruptFlags, kSDIF_DataTransferStatus))
    {
        SDIF_TransferHandleData(base, handle, interruptFlags);
    }
    if (IS_SDIF_FLAG_SET(interruptFlags, kSDIF_SDIOInterrupt))
    {
        SDIF_TransferHandleSDIOInterrupt(base, handle);
    }
    if (IS_SDIF_FLAG_SET(dmaInterruptFlags, kSDIF_DMAAllStatus))
    {
        SDIF_TransferHandleDMA(base, handle, dmaInterruptFlags);
    }
    if (IS_SDIF_FLAG_SET(interruptFlags, kSDIF_CardDetect))
    {
        SDIF_TransferHandleCardDetect(base, handle);
    }

    SDIF_ClearInterruptStatus(base, interruptFlags);
    SDIF_ClearInternalDMAStatus(base, dmaInterruptFlags);
}

/*!
 * brief SDIF module deinit function.
 * user should call this function follow with IP reset
 * param base SDIF peripheral base address.
 */
void SDIF_Deinit(SDIF_Type *base)
{
#if !(defined(FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL) && FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL)
    /* Disable the clock. */
    CLOCK_DisableClock(kCLOCK_Sdio);
#endif /* FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL */
    /* disable the SDIOCLKCTRL */
    SYSCON->SDIOCLKCTRL &= ~(SYSCON_SDIOCLKCTRL_CCLK_SAMPLE_DELAY_ACTIVE_MASK |
                             SYSCON_SDIOCLKCTRL_CCLK_DRV_DELAY_ACTIVE_MASK | SYSCON_SDIOCLKCTRL_PHASE_ACTIVE_MASK);

#if !(defined(FSL_SDK_DISABLE_DRIVER_RESET_CONTROL) && FSL_SDK_DISABLE_DRIVER_RESET_CONTROL)
    /* Reset the module. */
    RESET_PeripheralReset(kSDIO_RST_SHIFT_RSTn);
#endif /* FSL_SDK_DISABLE_DRIVER_RESET_CONTROL */
}

#if defined(SDIF)
void SDIF_DriverIRQHandler(void);
void SDIF_DriverIRQHandler(void)
{
    assert(s_sdifHandle[0] != NULL);

    s_sdifIsr(SDIF, s_sdifHandle[0]);
    SDK_ISR_EXIT_BARRIER;
}
#endif
